import React from "react";
import tw from "twin.macro";
import { css } from "styled-components/macro"; //eslint-disable-line
import AnimationRevealPage from "helpers/AnimationRevealPage.js";
import Hero from "components/hero/TwoColumnWithInput.js";
import Features from "components/features/ThreeColWithSideImage.js";
import FAQ from "components/faqs/SingleCol.js";
import ThreeColSlider from "components/cards/ThreeColSlider";

export default () => {
  const Subheading = tw.span`uppercase tracking-widest font-bold text-primary-500`;
  const HighlightedText = tw.span`text-primary-500`;

  return (
    <AnimationRevealPage>
      <Hero roundedHeaderButton={true} />
      <Features
        heading={
          <>
            چرا ابرکوین را انتخاب کنیم؟
          </>
        }
      />
      <FAQ
        heading={
          <>
            سوالات متداول
          </>
        }
        faqs={[
          {
            question: "چطور شروع کنم؟",
            answer:
              "کار با ابرکوین بسیار ساده است. پس از ثبت نام و احراز هویت می‌توانید یک حساب کاربری برای خود ایجاد نمایید و مبلغ یا رمزارز مورد نظر خود را به کیف پول شخصیتان واریز نموده و اقدام به خرید و فروش به صورت آنلاین نمایند."
          },
          {
            question: "صرافی و ربات آربیتراژ «ابرکوین» چیست؟",
            answer:
              "صرافی و ربات آربیتراژ «ابرکوین» دو بخش مجزا را برای کاربران درنظر گرفته است. در بخش اول؛ اگر قصد خرید یا فروش ارزهای دیجیتال را دارید، ابرکوین به شما کمک می‌کند در سریع‌ترین زمان این کار را انجام دهید.در بخش دوم؛ ربات آربیتراژ «ابرکوین» با استفاده از کادر مجرب و حرفه‌ای در زمینه رمز ارزها و حوزه بلاکچین توانسته با ایجاد دسترسی به تعداد زیادی از صرافی‌های معتبر جهانی به کاریران، این امکان را فراهم نماید تا آنها بتوانند با انتخاب صرافی‌های دلخواه خود، به‌صورت کاملا اتوماتیک اقدام به سودآوری برای خود نمایند."
          },
          {
            question: "برای احراز هویت در ابرکوین، چه اطلاعاتی لازم است؟",
            answer:
              "شروع ثبت‌نام با استفاده از شماره تلفن همراه امکان پذیر خواهد بود. در ادامه با توجه به سطح کاربری مورد نیاز، کاربر باید اقدام به تکمیل اطلاعات پروفایل خود نماید. در سطح یک، کاربر ملزم به ارائه شماره تلفن همراه، اسکن رنگی کارت ملی، پاسپورت یا شناسنامه جدید، شماره کارت بانکی، حساب و شبا به نام خود کاربر می باشد. همچنین برای ارتقا به سطح دو کاربری، آدرس و تلفن ثابت به همراه قبض حاوی آدرس، تصویر سلفی طبق الگوی سایت و شماره همراه به نام خود کاربر مورد نیاز است."
          },
          {
            question: "هزینه استفاده از ربات آربیتراژ ابرکوین، چه میزان است؟",
            answer:
              "ربات معاله‌گر آربیتراژ ابرکوین به‌صورت رایگان در اختیار کاربران قرار می‌گیرد و هزینه‌ای بابت استفاده از آن از کاربر دریافت نمی‌شود و صرفاً بابت هر معامله و سود حاصل از آن، درصدی به عنوان کمیسیون (کارمزد) کسر می‌گردد."
          },
          {
            question: "چگونه در ابرکوین، خرید و فروش ارز دیجیتال را انجام دهم؟",
            answer:
              "پس از افتتاح حساب، احراز هویت و تأیید حساب در صرافی ابرکوین، کاربران محترم می‌توانند نسبت به خرید و فروش رمزارزهای موردنظر خود اقدام نمایند."
          },
          {
            question: "در حال حاضر، بخش صرافی ابرکوین چه میزان کمیسیون معامله دریافت می‌کند؟",
            answer:
              "در حال حاضر کارمزد خرید و فروش رمزارزها در ابرکوین به میزان ۰.۲ درصد انجام می‌شود. به دلیل عدم وجود قانون در زمینه تبادل ارزهای دیجیتال در ایران، در حال حاضر هیچ‌گونه هزینه اضافی اعم از مالیات و … متوجه کاربران محترم نخواهد بود."
          }
        ]}
      />
      <ThreeColSlider />
      {/* <GetStarted/> */}
      {/* <Footer /> */}
    </AnimationRevealPage>
  );
}
